InformationRegisters/Игра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>Игра</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСтрокиТаблицы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерКолонкиТаблицы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыХодов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИнформацияПоИгре</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформацияПоИгре</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВариантыХодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ВариантыХодов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Крестик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нолик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ИнформацияПоИгре.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ИнформацияПоИгре</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Крестик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Нолик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИграОкончена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Победитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/хСервер/Ext/Module.bsl
Функция ПолучитьПользователя(Запрос,Ответ)ЭКСПОРТ
	СыраяСтрока=Запрос.Заголовки.Получить("Cookie");
	Если СыраяСтрока=Неопределено тогда
		Заголовки=Новый Соответствие;
		Заголовки.Вставить("Set-Cookie","user="+Строка(Новый УникальныйИдентификатор())+"; path=/");
		Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
		Ответ.Заголовки= Заголовки;
		
		Тело="<!Doctype html"+
		"<html>"+
		"<head>"+
		"<meta http-equiv=""Refresh"" content=""0;""/> "+
		"</head>"+
		"<body>"+
		"Its ref page";
		Для каждого ключЗнач из Запрос.Заголовки цикл
			Тело=Тело+"<p>"+ключЗнач.ключ +" - " +ключЗнач.Значение +"</p>";
		КонецЦикла;
		Тело=Тело+"</body>"+
		"</html>";
		Ответ.УстановитьТелоИзСтроки(Тело);
		Возврат Неопределено;
	КонецЕсли;
	Пользователь=СтрЗаменить(СыраяСтрока,"user=","");
	Возврат Пользователь;
КонецФункции



Процедура Вернуть404(Ответ) ЭКСПОРТ
Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
Ответ.КодСостояния=404;
Тело="<!Doctype html"+
		"<html>"+
		"<head>"+
		"</head>"+
		"<body>"+
		"Что-то пошло не так."+
		"</body>"+
		"</html>";
Ответ.УСтановитьТелоИЗСтроки(Тело);
КонецПроцедуры


Функция ПолучитьБлокИнформацияПоИгре(ИдСтрокой,Наименование,Крестик,Нолик,СейчасХод,Ход) ЭКСПОРТ
	Структура=Новый Структура;
	Структура.Вставить("Наименование",Наименование);
	Структура.Вставить("ИдСтрокой",ИдСтрокой);
	Структура.Вставить("Крестик",Крестик);
	Структура.Вставить("Нолик",Нолик);
	Структура.Вставить("СейчасХод",СейчасХод);
	Структура.Вставить("Ход",Ход);
	Возврат ПолучитьБлокИнформацияПоИгреПоДанным(Структура);
КонецФункции




Функция ПолучитьБлокИнформацияПоИгреПоДанным(ДанныеДляЗаполнения)
ИсходныйТекст="<div><a href='"+Константы.БазовыйПутьКСерверу.Получить()+Метаданные.HTTPСервисы.ЧерезШаблоны.КорневойURL+"/game/{guid}"+"'>
|Наименование: <FONT style='BACKGROUND-COLOR: #ff00ff'>[Наименование]</FONT><BR>
|Крестик: <FONT style='BACKGROUND-COLOR: #ffa500'>[Крестик]</FONT><BR>
|Нолик: <FONT style='BACKGROUND-COLOR: #ffa500'>[Нолик]</FONT><BR>
|Сейчас ходит: <FONT style='BACKGROUND-COLOR: #00fa9a'>[СейчасХод]</FONT> в [Ход]
|</a></div>	
|<div style='background: grey; width: 100%; height: 10px; margin-top: 10px; margin-bottom: 10px;'></div>
|";
ИсходныйТекст=СтрЗаменить(ИсходныйТекст,"{guid}",ДанныеДляЗаполнения.ИдСтрокой);
ИсходныйТекст=СтрЗаменить(ИсходныйТекст,"[Наименование]",ДанныеДляЗаполнения.Наименование);
ИсходныйТекст=СтрЗаменить(ИсходныйТекст,"[Крестик]",ДанныеДляЗаполнения.Крестик);
ИсходныйТекст=СтрЗаменить(ИсходныйТекст,"[Нолик]",ДанныеДляЗаполнения.Нолик);
ИсходныйТекст=СтрЗаменить(ИсходныйТекст,"[СейчасХод]",ДанныеДляЗаполнения.СейчасХод);
ИсходныйТекст=СтрЗаменить(ИсходныйТекст,"[Ход]",ДанныеДляЗаполнения.Ход);
Возврат ИсходныйТекст;
КонецФункции

Функция ПолучитьСтраницу(Пользователь,Контент) ЭКСПОРТ
	Структура=Новый Структура;
	Структура.Вставить("Пользователь",Пользователь);
	Структура.Вставить("Контент",Контент);
	Возврат ПолучитьСтраницуПоДанным(Структура);
КонецФункции


Функция ПолучитьСтраницуПоДанным(ДанныеДляЗаполнения)	
ИсходныйТекст="<!Doctype html>
|<html>
|<head>
|<style>
|td{
//|	padding:10px;
|}
|</style>
|</head>
|<body>
|<P>Добро пожаловать: [Пользователь]&nbsp; [Сейчас]&nbsp; <a href='[ПутьКНачальнойСтранице]'>Вернуться на начальную страницу</a></P>
|<div id='status'></div>
|[Контент]
|</body>
|</html>
|";
ИсходныйТекст=СтрЗаменить(ИсходныйТекст,"[ПутьКНачальнойСтранице]",Константы.БазовыйПутьКСерверу.Получить()+Метаданные.HTTPСервисы.ЧерезШаблоны.КорневойURL+Метаданные.HTTPСервисы.ЧерезШаблоны.ШаблоныURL.ОсновнаяСтраница.Шаблон);
ИсходныйТекст=СтрЗаменить(ИсходныйТекст,"[Пользователь]",ДанныеДляЗаполнения.Пользователь);
ИсходныйТекст=СтрЗаменить(ИсходныйТекст,"[Сейчас]",Формат(ТекущаяДата(),"ДЛФ=DDT") );
ИсходныйТекст=СтрЗаменить(ИсходныйТекст,"[Контент]",ДанныеДляЗаполнения.Контент);
Возврат ИсходныйТекст;
КонецФункции


Функция КонтентСтраницаСоСпискомИгр() ЭКСПОРТ
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнформацияПоИгреСпр.Ссылка КАК Ссылка,
		|	ИнформацияПоИгреСпр.Наименование КАК Наименование,
		|	ИнформацияПоИгреСпр.Крестик КАК Крестик,
		|	ИнформацияПоИгреСпр.Нолик КАК Нолик,
		|	ЕСТЬNULL(ИграСрезПоследних.Ход, 0) КАК ПоследнийХод,
		|	ЕСТЬNULL(ИграСрезПоследних.Значение, ЗНАЧЕНИЕ(Перечисление.ВариантыХодов.Крестик)) КАК ПоследнийПоходивший
		|ИЗ
		|	Справочник.ИнформацияПоИгре КАК ИнформацияПоИгреСпр
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Игра.СрезПоследних КАК ИграСрезПоследних
		|		ПО (ИнформацияПоИгреСпр.Ссылка = ИграСрезПоследних.ИнформацияПоИгре)
		|ГДЕ
		|	ИнформацияПоИгреСпр.ИграОкончена = ЛОЖЬ";
	                                               
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Контент="<form action="""+Константы.БазовыйПутьКСерверу.Получить()+Метаданные.HTTPСервисы.ЧерезШаблоны.КорневойURL+Метаданные.HTTPСервисы.ЧерезШаблоны.ШаблоныURL.Post.Шаблон+
	""" method=""post""><input name=""inamegame""><input type=""hidden"" name=""hinputgame"" value=""twilight""><input type=""submit"" Value=""Созданить новую"" ></form>";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ид=Строка(ВыборкаДетальныеЗаписи.Ссылка.УникальныйИдентификатор());
		Наименование=ВыборкаДетальныеЗаписи.Наименование;
		Крестик=ВыборкаДетальныеЗаписи.Крестик;
		Нолик=ВыборкаДетальныеЗаписи.Нолик;
		Если ВыборкаДетальныеЗаписи.ПоследнийПоходивший=Перечисления.ВариантыХодов.Крестик тогда
			СейчасХод="Нолик";
		Иначе
			СейчасХод="Крестик";	
		КонецЕсли;
		Ход=ВыборкаДетальныеЗаписи.ПоследнийХод+1;
		Контент=Контент+хСервер.ПолучитьБлокИнформацияПоИгре(ид,Наименование,Крестик,Нолик,СейчасХод,Ход);		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	Возврат Контент;	
КонецФункции

Функция ТаблицаПоИгре(идСтрокой,Пользователь) ЭКСПОРТ
	
	Таблица=Новый Массив(10,10);
	Для СчетчикСтрок=0 по 9 цикл
		Для кол=0 по 9 цикл
			Таблица[СчетчикСтрок][кол]="-";	
		КонецЦикла;
	КонецЦикла;
	СсылкаНаСправочник=Справочники.ИнформацияПоИгре.ПолучитьСсылку(Новый УникальныйИдентификатор(идСтрокой));
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнформацияПоИгреС.Ссылка КАК Ссылка,
		|	ИнформацияПоИгреС.Наименование КАК Наименование,
		|	ИнформацияПоИгреС.Крестик КАК Крестик,
		|	ИнформацияПоИгреС.Нолик КАК Нолик,
		|	ИнформацияПоИгреС.ИграОкончена КАК ИграОкончена,
		|	ИнформацияПоИгреС.Победитель КАК Победитель,
		|	ЕСТЬNULL(ИграСрезПоследних.Значение, ЗНАЧЕНИЕ(Перечисление.ВариантыХодов.Крестик)) КАК ПоследнийПоходивший,
		|	ЕСТЬNULL(ИграСрезПоследних.Ход,0) КАК ПоследнийХод
		|ИЗ
		|	Справочник.ИнформацияПоИгре КАК ИнформацияПоИгреС
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Игра.СрезПоследних КАК ИграСрезПоследних
		|		ПО ИнформацияПоИгреС.Ссылка = ИграСрезПоследних.ИнформацияПоИгре
		|ГДЕ
		|	ИнформацияПоИгреС.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаСправочник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Контент="";
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ид=Строка(ВыборкаДетальныеЗаписи.Ссылка.УникальныйИдентификатор());
		Наименование=ВыборкаДетальныеЗаписи.Наименование;
		Крестик=ВыборкаДетальныеЗаписи.Крестик;
		Если Пользователь=Крестик тогда
			Крестик="Это вы";	
		КонецЕсли;
		Нолик=ВыборкаДетальныеЗаписи.Нолик;
		Если Пользователь=Нолик тогда
			Нолик="Это вы";	
		КонецЕсли;

		
		Если ВыборкаДетальныеЗаписи.ПоследнийПоходивший=Перечисления.ВариантыХодов.Крестик тогда
			СейчасХод=?(Пользователь=ВыборкаДетальныеЗаписи.Нолик, "Ваш ход","Нолик");
		ИначеЕсли ВыборкаДетальныеЗаписи.ПоследнийПоходивший=Перечисления.ВариантыХодов.Нолик тогда
			СейчасХод=?(Пользователь=ВыборкаДетальныеЗаписи.Крестик, "Ваш ход","Крестик");
		Иначе
			СейчасХод="Ошибка";
		КонецЕсли;
		Ход=ВыборкаДетальныеЗаписи.ПоследнийХод+1;
		Контент=Контент+хСервер.ПолучитьБлокИнформацияПоИгре(ид,Наименование,Крестик,Нолик,СейчасХод,Ход);
	КонецЦикла;
	
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Игра.Период КАК Период,
		|	Игра.ИнформацияПоИгре КАК ИнформацияПоИгре,
		|	Игра.Ход КАК Ход,
		|	Игра.НомерСтрокиТаблицы КАК НомерСтрокиТаблицы,
		|	Игра.НомерКолонкиТаблицы КАК НомерКолонкиТаблицы,
		|	Игра.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.Игра КАК Игра
		|ГДЕ
		|	Игра.ИнформацияПоИгре = &ИнформацияПоИгре";
	Запрос.УстановитьПараметр("ИнформацияПоИгре",СсылкаНаСправочник);	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Значение="-";
		Если ВыборкаДетальныеЗаписи.Значение=Перечисления.ВариантыХодов.Крестик тогда
			Значение="х";
		ИначеЕсли ВыборкаДетальныеЗаписи.Значение=Перечисления.ВариантыХодов.Нолик тогда
			Значение="о";
		КонецЕсли;
		Таблица[ВыборкаДетальныеЗаписи.НомерСтрокиТаблицы-1][ВыборкаДетальныеЗаписи.НомерКолонкиТаблицы-1]=Значение;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
	
	Контент=Контент+"<script>
	|function pass(elem){
	| 	url='"+Константы.БазовыйПутьКСерверу.Получить()+Метаданные.HTTPСервисы.ЧерезШаблоны.КорневойURL+Метаданные.HTTPСервисы.ЧерезШаблоны.ШаблоныURL.ajax.Шаблон+"';
	|	var rowNomber=elem.dataset.row;
	|	var colNomber=elem.dataset.col;
	|	console.log(rowNomber+' '+colNomber);
	|	var idGame=document.getElementById('idgame').innerText;
	|	var sender=new XMLHttpRequest();
	|   sender.open('POST',url);
	|	sender.onload=function(){
	|       console.log(sender.response);
	|		if (sender.response=='Twilight'){document.location=document.location; return;}
	|		document.getElementById('status').innerText=sender.response;	
	|	}

	|	let jsonR={       
	|		ИмяОбработчика:'pass',
	|   	НомерСтрокиТаблицы:rowNomber,
	|   	НомерКолонкиТаблицы:colNomber,
	|   	ИдИгры:idGame
	|	};
	|	jsonS=JSON.stringify(jsonR);
	|  	sender.send(jsonS);
	|}
	|</script>
	|";
	Контент=Контент+"<div display=none visibility=hidden id='idgame'>"+идСтрокой+"</div>";
	Контент=Контент+"<table style=""border: 2px solid black; border-collapse: collapse;"" >";

	Для СчетчикСтрок=0 по 9 цикл
		Контент=Контент+"<tr style=""border: 2px solid black;"" >";
		Для кол=0 по 9 цикл
			Контент=Контент+"<td style=""border: 2px solid black;"" ><button data-row='"+Формат(СчетчикСтрок+1,"ЧГ=0")+"' data-col='"+Формат(кол+1,"ЧГ=0")+"' onclick='pass(this)'> "+Таблица[СчетчикСтрок][кол]+"</button></td>";
		КонецЦикла;
		Контент=Контент+"</tr>";
	КонецЦикла;
	Контент=Контент+"</table>";
	
	Возврат Контент;
КонецФункции
